gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/spiMaster.c
//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!    \file        Spi.c
//!    \brief       Functions for SPI pins.
//!
//!    \author
//!    \date
//!
//!    \notes
//!
//////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
// Header include
//////////////////////////////////////////////////////////////////////////////////////////////////

// STM Library includes
                                // NOTE: This file includes all peripheral.h files
#include "../inc/stm32f2xx_conf.h"     // Macro: assert_param() for other STM libraries.

// General Library includes
#include "../Utils/types.h"
#include "../Targets/Target_CurrentTarget.h"

#include "gpio.h"
#include "spi.h"

//////////////////////////////////////////////////////////////////////////////////////////////////
// Local Structure declarations and macros
//////////////////////////////////////////////////////////////////////////////////////////////////

#define SPI_FLAG_TOGGLE_WAITING_TIME_MS     (10)

///////////////////////////////////////////////////////
// SPI GPIOS CONFIGURATION
///////////////////////////////////////////////////////
// NOTE! Each bus has A CLK, MOSI, MISO
//       All pins must be initialized in main.c and Gpio.c
//       before the SPI uses them.
///////////////////////////////////////////////////////
typedef struct
{
    GpioPortEnum                tGpioPort;
    UINT8                       bGpioPin;
    GpioAlternativeFunctionEnum eAf;
}SpiGpioStruct;

///////////////////////////////////////////////////////
// BUS CONFIGURATIONS
///////////////////////////////////////////////////////
// NOTE! Each SPI can have different slaves with
//      their own particular configuration
///////////////////////////////////////////////////////
typedef struct
{
    const UINT16                wSPI_Mode;
    const UINT16                wSPI_DataSize;
    const UINT16                wSPI_CPOL;
    const UINT16                wSPI_CPHA;
    const UINT16                wSPI_BaudRatePrescaler;
    const UINT16                wSPI_FirstBit;
}SpiBusConfigStruct;

///////////////////////////////////////////////////////
// ENCAPSULATION OF SPI STRUCTURES ABOVE
///////////////////////////////////////////////////////
typedef struct
{
    const SpiBusEnum            		eBusId;
    const SpiBusConfigStruct * const 	ptConf;
}SpiSlaveBusStruct;

///////////////////////////////////////////////////////
// SPI SLAVE FINAL CONTAINER
// Populate this structure for proper work of routines.
///////////////////////////////////////////////////////
typedef struct
{
    const CHAR  * const 		pcSlaveName;
    const SpiSlaveBusStruct     tSpiBus;
	const SpiGpioStruct     	tGpioCs;
}SpiSlaveStruct;

///////////////////////////////////////////////////////
// BUS STATUS
///////////////////////////////////////////////////////
// NOTE! Variables that inform the status of the SPI
//      BUS
///////////////////////////////////////////////////////

typedef struct
{
    BOOL            			fIsBusRetained;
    SpiSlaveEnum                eCurrentSlave;
}SpiBusStatusStruct;

///////////////////////////////////////////////////////
// SPI BUS GENERAL VARIABLES
///////////////////////////////////////////////////////
// NOTE! General configs for a particular SPI
//      Bus.
///////////////////////////////////////////////////////
typedef struct
{
    const CHAR          * const pcBusName;
    SPI_TypeDef         * const tSPIx;
	UINT32                      dwRcc;
    const SpiGpioStruct     	tGpioMosi;
    const SpiGpioStruct     	tGpioMiso;
	const SpiGpioStruct     	tGpioClock;
    SpiBusStatusStruct          tStat;
}SpiBusStruct;

//////////////////////////////////////////////////////////////////////////////////////////////////
// Local Variables
//////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////
// LIST OF AVAILABLE SPI BUS TO BE USED IN THE PROJECT
// NOTE!! This list has to match with SpiBusEnum elements.
////////////////////////////////////////////////////////////////
static SpiBusStruct gtSpiBusLookupTable[] =
{
    ////////////////////////////////////
    // SPI BUS: SPI1
    ////////////////////////////////////
    {
		// pcBusName
		"SPI1",
		// tSPIx
		SPI1,
		// dwRcc
		RCC_APB2Periph_SPI1,
		// tGpioMosi
		{
			// tGpioPort
			GPIO_PORT_A,
			// bGpioPin
			6,
			// eAf
			GPIO_ALT_FUNC_SPI1_SPI2
		},
		// tGpioMiso
		{
			// tGpioPort
			GPIO_PORT_A,
			// bGpioPin
			7,
			// eAf
			GPIO_ALT_FUNC_SPI1_SPI2
		},
		// tGpioClock
		{
			// tGpioPort
			GPIO_PORT_A,
			// bGpioPin
			5,
			// eAf
			GPIO_ALT_FUNC_SPI1_SPI2
		},
		// tStat
		{
			// fIsBusRetained
			FALSE,
			// eCurrentSlave
			SPI_SLAVE_INVALID
		}
    },
};

#define SPI_BUS_COUNT       ( sizeof(gtSpiBusLookupTable)/sizeof(gtSpiBusLookupTable[0]) )

////////////////////////////////////////////////////////////////
// LIST OF SLAVE BUS CONFIGURATIONS
////////////////////////////////////////////////////////////////
static const SpiBusConfigStruct tSlaveDummyBusConfigurations =
{
/*    mode          */  SPI_Mode_Master,
/*    data size     */  SPI_DataSize_8b,
/*    clock polarity*/  SPI_CPOL_High,
/*    clock phase   */  SPI_CPHA_2Edge,
/*    presc Baud    */  SPI_BaudRatePrescaler_2,
/*    Indianness    */  SPI_FirstBit_MSB
};

static const SpiBusConfigStruct tSlaveDataFlashBusConfigurations =
{
/*    mode          */  SPI_Mode_Master,
/*    data size     */  SPI_DataSize_8b,
/*    clock polarity*/  SPI_CPOL_High,
/*    clock phase   */  SPI_CPHA_2Edge,
/*    presc Baud    */  SPI_BaudRatePrescaler_32,   // SPI slowed for system operation at 120MHz
/*    Indianness    */  SPI_FirstBit_MSB
};

static const SpiBusConfigStruct tSlaveAccelBusConfigurations =
{
/*    mode          */  SPI_Mode_Master,
/*    data size     */  SPI_DataSize_8b,
/*    clock polarity*/  SPI_CPOL_High,
/*    clock phase   */  SPI_CPHA_2Edge,
/*    presc Baud    */  SPI_BaudRatePrescaler_16,
/*    Indianness    */  SPI_FirstBit_MSB
};

static const SpiBusConfigStruct tSlavePortExBusConfigurations =
{
/*    mode          */  SPI_Mode_Master,
/*    data size     */  SPI_DataSize_8b,                        
/*    clock polarity*/  SPI_CPOL_Low,           
/*    clock phase   */  SPI_CPHA_1Edge,                           
/*    presc Baud    */  SPI_BaudRatePrescaler_8,                        
/*    Indianness    */  SPI_FirstBit_MSB                        
};
        
static const SpiBusConfigStruct tSlaveAdcExBusConfigurations =
{
/*    mode          */  SPI_Mode_Master,
/*    data size     */  SPI_DataSize_8b,                        
/*    clock polarity*/  SPI_CPOL_High,           
/*    clock phase   */  SPI_CPHA_2Edge,     // ??????????
/*    presc Baud    */  SPI_BaudRatePrescaler_8,                        
/*    Indianness    */  SPI_FirstBit_MSB                        
};

////////////////////////////////////////////////////////////////
// LIST OF SLAVES TO BE USED IN THE PROJECT
// NOTE!! This list has to match with SpiSlaveEnum elements.
////////////////////////////////////////////////////////////////
static const SpiSlaveStruct gtSpiSlaveLookupTable[] =
{
    ////////////////////////////////////
    // SPI SLAVE: 
    ////////////////////////////////////
    {
        // Slave name
        "MEM_1",
		// tSpiBus
		{
			// eBusId
			SPI_BUS_1,
			// ptConf
			(SpiBusConfigStruct * const)&tSlaveDummyBusConfigurations	
		},
		// tGpioCs
		{
			// tGpioPort
			GPIO_PORT_A,
			// bGpioPin
			4,
			// eAf
			GPIO_ALT_FUNC_UNKNOWN
		}
    }
};

#define SPI_SLAVE_COUNT     ( sizeof(gtSpiSlaveLookupTable)/sizeof(gtSpiSlaveLookupTable[0]) )

//////////////////////////////////////////////////////////////////////////////////////////////////
// Local Functions
//////////////////////////////////////////////////////////////////////////////////////////////////

