gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/spiMaster.c
static BOOL SpiIsBusPoweredOn           ( SpiBusEnum eSpiBus );
static BOOL SpiBusLock                  ( SpiBusEnum eSpiBus, UINT32 dwWaitingTicks );
static BOOL SpiBusUnlock                ( SpiBusEnum eSpiBus );
static BOOL SpiIsBusLocked              ( SpiBusEnum eSpiBus );
static BOOL SpiBusConnectToGpio         ( SpiBusEnum eSpiBus, BOOL fConnect );
static BOOL SpiBusSetSlaveConfig        ( SpiBusEnum eSpiBus, SpiSlaveEnum eSpiSlave );
static BOOL SpiIsBusReadyForSlaveUse    ( SpiSlaveEnum eSpiSlave, SpiBusEnum    *peSpiBus );


static BOOL SpiBusClockEnable			( SpiBusEnum eSpiBus, BOOL fEnable );

/////////////////////////////////// BODY OF THE LIBRARY //////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SpiModuleInit( void )
{
    BOOL fSuccess = FALSE;

    // Make sure the amount of elements in the arrays matches the elements in the enums
	fSuccess = TRUE;
    fSuccess &= ( SPI_SLAVE_COUNT == SPI_SLAVE_TOTAL );
    fSuccess &= ( SPI_BUS_COUNT   == SPI_BUS_TOTAL   );

    if( fSuccess == FALSE )
    {
		while(1);
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SpiBusClockEnable( SpiBusEnum eSpiBus, BOOL fEnable )
{
    BOOL fSuccess = FALSE;

    if( eSpiBus < SPI_BUS_COUNT )
    {
		// Select between APB1 or APB2 to start SPI clock
        switch( gtSpiBusLookupTable[eSpiBus].dwRcc )
        {
            case RCC_APB2Periph_SPI1:
                if( fEnable )
                {
                    RCC->APB2ENR |= gtSpiBusLookupTable[eSpiBus].dwRcc;
                }
                else{
                    RCC->APB2ENR &= ~gtSpiBusLookupTable[eSpiBus].dwRcc;
                }
                fSuccess = TRUE;
                break;

            case RCC_APB1Periph_SPI2:
            case RCC_APB1Periph_SPI3:
                if( fEnable )
                {
                    RCC->APB1ENR |= gtSpiBusLookupTable[eSpiBus].dwRcc;
                }
                else{
                    RCC->APB1ENR &= ~gtSpiBusLookupTable[eSpiBus].dwRcc;
                }
                fSuccess = TRUE;
                break;
            default:
                break;
        }
    }

    return fSuccess;
}

BOOL SpiBusEnable( SpiBusEnum eSpiBus, BOOL fEnable )
{
	BOOL fSuccess = FALSE;
	
	if( eSpiBus < SPI_BUS_COUNT )
    {
		if( fEnable )
		{
			if( SpiIsBusEnabled( eSpiBus ) == FALSE )
			{
				// NOTE:
				// make sure all the slaves chip selects that are going to be using that spi bus 
				// are NOT asserted when initializing spi bus
				for( UINT8 bSlave = 0; bSlave < SPI_SLAVE_COUNT ; bSlave )
				{
					// only if slave is going to be using this bus
					if( gtSpiSlaveLookupTable[bSlave].tSpiBus.eBusId == eSpiBus )
					{
						// initialize gpio as output disasserted
						if( GpioPortClockIsEnabled( gtSpiSlaveLookupTable[eSpiBus].tGpioCs.tGpioPort ) == FALSE )
						{
							GpioPortClockEnable( gtSpiSlaveLookupTable[eSpiBus].tGpioCs.tGpioPort, fEnable );
						}
						// prepare pin for output
						GpioPuPdSetVal( gtSpiSlaveLookupTable[eSpiBus].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[eSpiBus].tGpioCs.bGpioPin, GPIO_PUPD_NOPUPD );
						GpioSpeedSetVal( gtSpiSlaveLookupTable[eSpiBus].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[eSpiBus].tGpioCs.bGpioPin, GPIO_OSPEED_25MHZ );
						GpioOTypeSetVal( gtSpiSlaveLookupTable[eSpiBus].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[eSpiBus].tGpioCs.bGpioPin, GPIO_OTYPE_PUSH_PULL );
						GpioModeSetOutput( gtSpiSlaveLookupTable[eSpiBus].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[eSpiBus].tGpioCs.bGpioPin );
						
						// Chip select unasserted
						SpiSlaveChipSelectAssert( bSlave, FALSE );
					}
				}
				
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				// GPIO CLK PIN
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				if( GpioPortClockIsEnabled( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort ) == FALSE )
				{
					GpioPortClockEnable( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, fEnable );
				}
				// prepare pin for output
				GpioSpeedSetVal( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin, GPIO_OSPEED_25MHZ );
				GpioPuPdSetVal( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin, GPIO_PUPD_NOPUPD );
				GpioOTypeSetVal( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin, GPIO_OTYPE_PUSH_PULL );
				GpioModeSetOutput( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin );
				// change gpio as Alternative function
				GpioModeSetAf( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin, gtSpiBusLookupTable[eSpiBus].tGpioClock.eAf );
				
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				// GPIO MOSI PIN
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				if( GpioPortClockIsEnabled( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort ) == FALSE )
				{
					GpioPortClockEnable( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, fEnable );
				}
				// prepare pin for output
				GpioSpeedSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin, GPIO_OSPEED_25MHZ );
				GpioPuPdSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin, GPIO_PUPD_NOPUPD );
				GpioOTypeSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin, GPIO_OTYPE_PUSH_PULL );
				GpioModeSetOutput( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin );
				// change gpio as Alternative function
				GpioModeSetAf( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin, gtSpiBusLookupTable[eSpiBus].tGpioMosi.eAf );
				
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				// GPIO MISO PIN
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				if( GpioPortClockIsEnabled( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort ) == FALSE )
				{
					GpioPortClockEnable( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, fEnable );
				}
				// prepare pin for output
				GpioSpeedSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin, GPIO_OSPEED_25MHZ );
				GpioPuPdSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin, GPIO_PUPD_NOPUPD );
				GpioModeSetInput( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin );
				// change gpio as Alternative function
				GpioModeSetAf( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin, gtSpiBusLookupTable[eSpiBus].tGpioMiso.eAf );
				
				// enable periph clock
				SpiBusClockEnable( eSpiBus, fEnable );

				// configure spi 
				// only when slave make use of the bus since each slave has different configuration requirements
				// enable spi (this is done when spi is configured for particular slave)
			}
			
			fSuccess = TRUE;
		}
		else
		{
			// disable procedure
			if( SpiIsBusEnabled( eSpiBus ) == TRUE )
			{
				// NOTE:
				// make sure all the slaves chip selects are NOT asserted when disapling spi bus
				for( UINT8 bSlave = 0; bSlave < SPI_SLAVE_COUNT ; bSlave )
				{
					// only if slave is going to be using this bus
					if( gtSpiSlaveLookupTable[bSlave].tSpiBus.eBusId == eSpiBus )
					{
						// Chip select unasserted
						SpiSlaveChipSelectAssert( bSlave, FALSE );
					}
				}
				
				// enable periph clock
				SpiBusClockEnable( eSpiBus, fEnable );
				
				// all gpios as inputs
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				// GPIO MISO PIN
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				GpioSpeedSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin, GPIO_OSPEED_2MHZ );
				GpioPuPdSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin, GPIO_PUPD_P_DOWN );
				GpioModeSetInput( gtSpiBusLookupTable[eSpiBus].tGpioMiso.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMiso.bGpioPin );
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				// GPIO MOSI PIN
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				GpioSpeedSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin, GPIO_OSPEED_2MHZ );
				GpioPuPdSetVal( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin, GPIO_PUPD_P_DOWN );
				GpioModeSetInput( gtSpiBusLookupTable[eSpiBus].tGpioMosi.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioMosi.bGpioPin );
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				// GPIO CLK PIN
				// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
				GpioSpeedSetVal( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin, GPIO_OSPEED_2MHZ );
				GpioPuPdSetVal( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin, GPIO_PUPD_P_DOWN );
				GpioModeSetInput( gtSpiBusLookupTable[eSpiBus].tGpioClock.tGpioPort, gtSpiBusLookupTable[eSpiBus].tGpioClock.bGpioPin );
				
				// set all bus chip select pins as inputs
				for( UINT8 bSlave = 0; bSlave < SPI_SLAVE_COUNT ; bSlave )
				{
					// only if slave is going to be using this bus
					if( gtSpiSlaveLookupTable[bSlave].tSpiBus.eBusId == eSpiBus )
					{
						GpioSpeedSetVal( gtSpiSlaveLookupTable[bSlave].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[bSlave].tGpioCs.bGpioPin, GPIO_OSPEED_2MHZ );
						GpioPuPdSetVal( gtSpiSlaveLookupTable[bSlave].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[bSlave].tGpioCs.bGpioPin, GPIO_PUPD_P_DOWN );
						GpioModeSetInput( gtSpiSlaveLookupTable[bSlave].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[bSlave].tGpioCs.bGpioPin );
					}
				}
			}
			
			fSuccess = TRUE;
		}
	}
}

BOOL SpiIsBusEnabled( SpiBusEnum eSpiBus )
{
	BOOL fEnabled = FALSE;

    if( eSpiBus < SPI_BUS_COUNT )
    {
		// Select between APB1 or APB2 to start SPI clock
        switch( gtSpiBusLookupTable[eSpiBus].dwRcc )
        {
            case RCC_APB1Periph_SPI2:
            case RCC_APB1Periph_SPI3:
                fEnabled = ( ( RCC->APB1ENR & gtSpiBusLookupTable[eSpiBus].dwRcc ) > 0 );
                break;

            case RCC_APB2Periph_SPI1:
                fEnabled = ( ( RCC->APB2ENR & gtSpiBusLookupTable[eSpiBus].dwRcc ) > 0 );
                break;
            default:
                break;
        }
    }

    return fEnabled;
}

BOOL SpiIsAnySlaveHoldingBus( SpiBusEnum eSpiBus )
{
	BOOL fIsBusRetained = FALSE;

    if( eSpiBus < SPI_BUS_COUNT )
    {
		fIsBusRetained = gtSpiBusLookupTable[eSpiBus].tStat.fIsBusRetained;
	}
	
	return fIsBusRetained;
}

BOOL SpiGetSlaveHoldingBus( SpiBusEnum eSpiBus, SpiSlaveEnum *peSpiSlave )
{
	BOOL fSuccess = FALSE;

    if( eSpiBus < SPI_BUS_COUNT )
    {
		if( peSpiSlave != NULL )
		{
			(*peSpiSlave) = gtSpiBusLookupTable[eSpiBus].tStat.eCurrentSlave;
		}
	}
	
