gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/spiMaster.c
	return fSuccess;
}

BOOL SpiSlaveRetainBus( SpiSlaveEnum eSpiSlave )
{
	BOOL fSuccess = FALSE;
	
	if( eSpiSlave < SPI_SLAVE_COUNT )
	{
		if( gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.fIsBusRetained == FALSE )
		{
			gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.fIsBusRetained = TRUE;
			
			gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.eCurrentSlave = eSpiSlave;
			
			// configure spi
			SpiBusSetSlaveConfig( gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId, eSpiSlave );
			
			// enable spi periph
			SPI_Cmd( gtSpiBusLookupTable[ gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId ].tSPIx, ENABLE );
			
			fSuccess = TRUE;
		}
		else
		{
			// check if the bus is already retained by the same slave
			if( gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.eCurrentSlave == eSpiSlave )
			{
				fSuccess = TRUE;
			}
		}
	}
	
	return fSuccess;
}

BOOL SpiSlaveReleaseBus( SpiSlaveEnum eSpiSlave )
{
	BOOL fSuccess = FALSE;
	
	if( eSpiSlave < SPI_SLAVE_COUNT )
	{
		if( gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.fIsBusRetained == TRUE )
		{
			// make sure that only the slave that is holding the bus is releasing it
			if( gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.eCurrentSlave == eSpiSlave )
			{
				gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.fIsBusRetained = FALSE;
				
				gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.eCurrentSlave = SPI_SLAVE_INVALID;
				
				// disable spi periph
				SPI_Cmd( gtSpiBusLookupTable[ gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId ].tSPIx, DISABLE );
				
				fSuccess = TRUE;				
			}
		}
		else if( gtSpiBusLookupTable[gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId].tStat.fIsBusRetained == FALSE )
		{
			// if bus is not retained by anybody
			fSuccess = TRUE;
		}
	}
	
	return fSuccess;
}

BOOL SpiBusSetSlaveConfig( SpiBusEnum eSpiBus, SpiSlaveEnum eSpiSlave )
{
    BOOL 			fSuccess = FALSE;
	SPI_InitTypeDef SPI_InitStructure;
	FunctionalState NewState = DISABLE;

    if( eSpiBus < SPI_BUS_COUNT )
    {
        if( eSpiSlave < SPI_SLAVE_COUNT )
		{
			if( SpiIsBusEnabled( eSpiBus ) )
			{
				// #### RESET SPI VALS ####
				// Set init structure to default values
				SPI_StructInit( &SPI_InitStructure );
				// Deinitialize the SPIx peripheral registers to their default reset values.
				SPI_I2S_DeInit( gtSpiBusLookupTable[ eSpiBus ].tSPIx );

				// #### SPI COMMON CONFIGS ####
				SPI_InitStructure.SPI_Mode              = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.ptConf->wSPI_Mode;
				SPI_InitStructure.SPI_DataSize          = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.ptConf->wSPI_DataSize;
				SPI_InitStructure.SPI_CPOL              = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.ptConf->wSPI_CPOL;
				SPI_InitStructure.SPI_CPHA              = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.ptConf->wSPI_CPHA;
				SPI_InitStructure.SPI_BaudRatePrescaler = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.ptConf->wSPI_BaudRatePrescaler;
				SPI_InitStructure.SPI_FirstBit          = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.ptConf->wSPI_FirstBit;
				// All configurations are set to full Duplex.
				// When sending or receiving bytes, pointer to gpios is checked to determine if MOSI or MISO can be used.
				SPI_InitStructure.SPI_Direction         = SPI_Direction_2Lines_FullDuplex;
				SPI_InitStructure.SPI_NSS               = SPI_NSS_Soft;
				SPI_InitStructure.SPI_CRCPolynomial     = 1;

				// #### SET SPI REGISTERS ####
				SPI_Init( gtSpiBusLookupTable[ eSpiBus ].tSPIx, &SPI_InitStructure );
				
				fSuccess = TRUE;
			}			
		}
    }

    return fSuccess;
}


BOOL SpiSlaveChipSelectAssert( SpiSlaveEnum eSpiSlave, BOOL fAssert )
{
    BOOL 			fSuccess = FALSE;
	SpiSlaveEnum 	eCurrentSlaveInBus;
	
	SpiGetSlaveHoldingBus( gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId, &eCurrentSlaveInBus );
	
    if( eCurrentSlaveInBus ==  eSpiSlave )
    {
		if( fAssert )
		{
			GpioOutputRegWrite( gtSpiSlaveLookupTable[eSpiSlave].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[eSpiSlave].tGpioCs.bGpioPin, GPIO_LOGIC_LOW );
		}
		else
		{
			GpioOutputRegWrite( gtSpiSlaveLookupTable[eSpiSlave].tGpioCs.tGpioPort, gtSpiSlaveLookupTable[eSpiSlave].tGpioCs.bGpioPin, GPIO_LOGIC_HIGH );
		}
    }

    return fSuccess;
}

BOOL SpiSlaveSendRecvByte( SpiSlaveEnum eSpiSlave, UINT8 bByteSend, UINT8 *pbByteRecvd )
{
	BOOL        	fSuccess    		= FALSE;
	SpiSlaveEnum 	eCurrentSlaveInBus;
	TIMER       	tWaitTimer  = 0;
	
	SpiGetSlaveHoldingBus( gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId, &eCurrentSlaveInBus );
	
    if( eCurrentSlaveInBus == eSpiSlave )
    {
		// make sure the bus is not bussy now with trasmission operation
		// Wait while DR register is not empty
		tWaitTimer = TimerDownTimerStartMs( SPI_FLAG_TOGGLE_WAITING_TIME_MS );
		while( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_BSY ) == SET )
		{
			if( TimerDownTimerIsExpired( tWaitTimer ) == TRUE )
			{
				return FALSE;
			}
		}
		
		// Send UINT8 through the SPI peripheral
		gtSpiBusLookupTable[ eSpiBus ].tSPIx->DR = bByteSend;

		// Wait to receive a byte
		tWaitTimer = TimerDownTimerStartMs( SPI_FLAG_TOGGLE_WAITING_TIME_MS );
		while ( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_RXNE ) == RESET )
		{
			if( TimerDownTimerIsExpired( tWaitTimer ) == TRUE )
			{
				return FALSE;
			}
		}
		
		// Read the received byte
		bByte = gtSpiBusLookupTable[ eSpiBus ].tSPIx->DR;

		// Store byte if pointer is not NULL
		if( pbByteRecvd != NULL )
		{
			*pbByteRecvd = bByte;
		}
		
		fSuccess = TRUE;
	}
	
	return fSuccess;
}


BOOL SpiSlaveSendRecvByteArray( SpiSlaveEnum eSpiSlave, const UINT8 * const pbByteArraySend, UINT8 * const pbByteArrayRecv, UINT16 wInOutByteArraySize )
{
    BOOL        	fSuccess    = FALSE;
    SpiBusEnum  	eSpiBus     = SPI_BUS_UNKNOWN;
	SpiSlaveEnum 	eCurrentSlaveInBus;
	UINT8 			bByteToSend;
    UINT8 			bByteReceived;
    TIMER       	tWaitTimer  = 0;

	SpiGetSlaveHoldingBus( gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId, &eCurrentSlaveInBus );
	
    if( eCurrentSlaveInBus == eSpiSlave )
    {
        if( ((pbByteArraySend != NULL) || (pbByteArrayRecv != NULL)) && (wInOutByteArraySize > 0) )
        {
			eSpiBus = gtSpiSlaveLookupTable[eSpiSlave].tSpiBus.eBusId;

