gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/spiMaster.c
			// make sure the bus is not bussy now with trasmission operation
            // Wait while DR register is not empty
            tWaitTimer = TimerDownTimerStartMs( SPI_FLAG_TOGGLE_WAITING_TIME_MS );
            while( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_BSY ) == SET )
            {
                if( TimerDownTimerIsExpired( tWaitTimer ) == TRUE )
                {
                    return FALSE;
                }
            }

			// rx tx data
            for( UINT16 i = 0; i < wInOutByteArraySize; i++ )
            {
                bByteToSend 	= 0x00;
                bByteReceived 	= 0x00;

                // Load value into data register (register used to send and receive data)
                if (pbByteArraySend != NULL)
                {
                    bByteToSend = pbByteArraySend[i];
                }

                // Send byte - clock activated by hardware automatically.
                gtSpiBusLookupTable[ eSpiBus ].tSPIx->DR = bByteToSend;


                // Wait to receive a byte
                tWaitTimer = TimerDownTimerStartMs( SPI_FLAG_TOGGLE_WAITING_TIME_MS );
                while ( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_RXNE ) == RESET )
                {
                    if( TimerDownTimerIsExpired( tWaitTimer ) == TRUE )
                    {
                        return FALSE;
                    }
                }

                // Load the value from data register (value received) into the array
                bByteReceived = gtSpiBusLookupTable[ eSpiBus ].tSPIx->DR;

                if (pbByteArrayRecv != NULL)
                {
                    pbByteArrayRecv[i] = bByteReceived;
                }
            }
			
			fSuccess = TRUE;
        }
    }

    return fSuccess;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn         BOOL SpiSendRecvByteArray( SpiSlaveEnum eSpiSlave, UINT8 *pbByteArraySend, UINT8 *pbByteArrayRecv, UINT16 wInOutByteArraySize )
//!
//! \brief      Send and/or receive a byte array to/from the spi bus
//!
//! \param[in]  eSpiSlave       Slave that is currently using the bus. Only this slave can use the bus
//!                             If any other slave that is in the same bus tries to use it,
//!                             it will fail because only one salve can use the bus.
//!
//! \param[in]  pbByteArraySend         byte array to send through the spi bus
//!
//! \param[in]  pbByteArrayRecv         byte array received from the spi bus
//!
//! \param[in]  wInOutByteArraySize     array size. Both send and receive arrays must be the same size.
//!
//! \return BOOLEAN
//!         - TRUE if operation successfully
//!         - FALSE if error on the operation
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SpiSlaveSendRecvByteArray( SpiSlaveEnum eSpiSlave, const UINT8 * const pbByteArraySend, UINT8 * const pbByteArrayRecv, UINT16 wInOutByteArraySize )
{
    BOOL        fSuccess    = FALSE;
    SpiBusEnum  eSpiBus     = SPI_BUS_UNKNOWN;
#ifndef BOOTLOADER_PROJECT
    TIMER       tWaitTimer  = 0;
#endif

    if( SpiIsBusReadyForSlaveUse( eSpiSlave, &eSpiBus ) )
    {
        // Check MOSI and MISO pins are not null
        if( ( gtSpiBusLookupTable[ eSpiBus ].tGpioMosi.ptPort == NULL ) ||
            ( gtSpiBusLookupTable[ eSpiBus ].tGpioMiso.ptPort == NULL ) )
        {
            return TRUE;    // Don't actually do transfer if dummy pins used
        }

        if( ((pbByteArraySend != NULL) || (pbByteArrayRecv != NULL)) && (wInOutByteArraySize > 0) )
        {
            fSuccess = TRUE;

#ifndef BOOTLOADER_PROJECT
            // Wait while DR register is not empty
            tWaitTimer = TimerDownTimerStartMs( SPI_FLAG_TOGGLE_WAITING_TIME_MS );
            while( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_BSY ) == SET )
            {
                if( TimerDownTimerIsExpired( tWaitTimer ) == TRUE )
                {
                    return FALSE;
                }
            }
#else
            while( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_BSY ) == SET ) {}
#endif

            for( UINT16 i = 0; i < wInOutByteArraySize; i++ )
            {
                UINT8 bByteToSend = 0x00;
                UINT8 bByteReceived;

                // Load value into data register (register used to send and receive data)
                if (pbByteArraySend != NULL)
                {
                    bByteToSend = pbByteArraySend[i];
                }

                // Send byte - clock activated by hardware automatically.
                gtSpiBusLookupTable[ eSpiBus ].tSPIx->DR = bByteToSend;

#ifndef BOOTLOADER_PROJECT
                // Wait to receive a byte
                tWaitTimer = TimerDownTimerStartMs( SPI_FLAG_TOGGLE_WAITING_TIME_MS );
                while ( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_RXNE ) == RESET )
                {
                    if( TimerDownTimerIsExpired( tWaitTimer ) == TRUE )
                    {
                        return FALSE;
                    }
                }
#else
                while ( SPI_I2S_GetFlagStatus( gtSpiBusLookupTable[ eSpiBus ].tSPIx, SPI_I2S_FLAG_RXNE ) == RESET ) {}
#endif

                // Load the value from data register (value received) into the array
                bByteReceived = gtSpiBusLookupTable[ eSpiBus ].tSPIx->DR;

                if (pbByteArrayRecv != NULL)
                {
                    pbByteArrayRecv[i] = bByteReceived;
                }
            }
        }
    }

    return fSuccess;
}

///////////////////////////////////////// END OF SOURCE //////////////////////////////////////////